; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p3)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 - Aircraft
 c1 c2 c3 c4 c5 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c2)
(fuel-level a2 f2) (at a2 c5)
(at p1 c2)
(at p2 c4)
(at p3 c5)
(at p4 c3)
(at p5 c4)
(at p6 c5)
(at p7 c5)
(at p8 c5)
(at p9 c3)
(at p10 c4)
(at p11 c2)
(at p12 c3)
(at p13 c2)
(at p14 c4)
(at p15 c4)
(at p16 c5)
(at p17 c5)
(at p18 c5)
(at p19 c4)
(at p20 c2)
(at p21 c4)
(at p22 c1)
(at p23 c1)
(at p24 c5)
)
(:goal (and
(at a1 c2)
(at a2 c5)
(at p1 c1)
(at p2 c2)
(at p3 c1)
(at p4 c4)
(at p5 c5)
(at p6 c1)
(at p7 c2)
(at p8 c1)
(at p9 c5)
(at p10 c1)
(at p11 c3)
(at p12 c5)
(at p13 c1)
(at p14 c1)
(at p15 c3)
(at p16 c5)
(at p17 c1)
(at p18 c3)
(at p19 c2)
(at p20 c2)
(at p21 c5)
(at p22 c2)
(at p23 c2)
(at p24 c2)
))
)

; plan
1. (board p1 a1 c2)
   deleted: (at p1 c2)
   added: (in p1 a1)
   goals met: 4 of 26
2. (fly a1 c2 c1 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 3 of 26
3. (debark p1 a1 c1)
   deleted: (in p1 a1)
   added: (at p1 c1)
   goals met: 4 of 26
4. (fly a1 c1 c4 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 4 of 26
5. (board p2 a1 c4)
   deleted: (at p2 c4)
   added: (in p2 a1)
   goals met: 4 of 26
6. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 4 of 26
7. (fly a1 c4 c2 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 5 of 26
8. (debark p2 a1 c2)
   deleted: (in p2 a1)
   added: (at p2 c2)
   goals met: 6 of 26
9. (board p3 a2 c5)
   deleted: (at p3 c5)
   added: (in p3 a2)
   goals met: 6 of 26
10. (fly a2 c5 c1 f2 f1)
   deleted: (at a2 c5) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 5 of 26
11. (debark p3 a2 c1)
   deleted: (in p3 a2)
   added: (at p3 c1)
   goals met: 6 of 26
12. (fly a1 c2 c3 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 5 of 26
13. (board p4 a1 c3)
   deleted: (at p4 c3)
   added: (in p4 a1)
   goals met: 5 of 26
14. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 5 of 26
15. (fly a1 c3 c4 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c4) (fuel-level a1 f1)
   goals met: 5 of 26
16. (debark p4 a1 c4)
   deleted: (in p4 a1)
   added: (at p4 c4)
   goals met: 6 of 26
17. (board p5 a1 c4)
   deleted: (at p5 c4)
   added: (in p5 a1)
   goals met: 6 of 26
18. (fly a1 c4 c5 f1 f0)
   deleted: (at a1 c4) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 6 of 26
19. (debark p5 a1 c5)
   deleted: (in p5 a1)
   added: (at p5 c5)
   goals met: 7 of 26
20. (board p6 a1 c5)
   deleted: (at p6 c5)
   added: (in p6 a1)
   goals met: 7 of 26
21. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 7 of 26
22. (fly a1 c5 c1 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 7 of 26
23. (debark p6 a1 c1)
   deleted: (in p6 a1)
   added: (at p6 c1)
   goals met: 8 of 26
24. (fly a1 c1 c5 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 8 of 26
25. (board p7 a1 c5)
   deleted: (at p7 c5)
   added: (in p7 a1)
   goals met: 8 of 26
26. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 8 of 26
27. (fly a1 c5 c2 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 9 of 26
28. (debark p7 a1 c2)
   deleted: (in p7 a1)
   added: (at p7 c2)
   goals met: 10 of 26
29. (fly a1 c2 c5 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 9 of 26
30. (board p8 a1 c5)
   deleted: (at p8 c5)
   added: (in p8 a1)
   goals met: 9 of 26
31. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 9 of 26
32. (fly a1 c5 c1 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 9 of 26
33. (debark p8 a1 c1)
   deleted: (in p8 a1)
   added: (at p8 c1)
   goals met: 10 of 26
34. (fly a1 c1 c3 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 10 of 26
35. (board p9 a1 c3)
   deleted: (at p9 c3)
   added: (in p9 a1)
   goals met: 10 of 26
36. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 10 of 26
37. (fly a1 c3 c5 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 10 of 26
38. (debark p9 a1 c5)
   deleted: (in p9 a1)
   added: (at p9 c5)
   goals met: 11 of 26
39. (fly a1 c5 c4 f1 f0)
   deleted: (at a1 c5) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 11 of 26
40. (board p10 a1 c4)
   deleted: (at p10 c4)
   added: (in p10 a1)
   goals met: 11 of 26
41. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 11 of 26
42. (fly a1 c4 c1 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 11 of 26
43. (debark p10 a1 c1)
   deleted: (in p10 a1)
   added: (at p10 c1)
   goals met: 12 of 26
44. (fly a1 c1 c2 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 13 of 26
45. (board p11 a1 c2)
   deleted: (at p11 c2)
   added: (in p11 a1)
   goals met: 13 of 26
46. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 13 of 26
47. (fly a1 c2 c3 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 12 of 26
48. (debark p11 a1 c3)
   deleted: (in p11 a1)
   added: (at p11 c3)
   goals met: 13 of 26
49. (board p12 a1 c3)
   deleted: (at p12 c3)
   added: (in p12 a1)
   goals met: 13 of 26
50. (fly a1 c3 c5 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 13 of 26
51. (debark p12 a1 c5)
   deleted: (in p12 a1)
   added: (at p12 c5)
   goals met: 14 of 26
52. (fly a2 c1 c2 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c2) (fuel-level a2 f0)
   goals met: 14 of 26
53. (board p13 a2 c2)
   deleted: (at p13 c2)
   added: (in p13 a2)
   goals met: 14 of 26
54. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 14 of 26
55. (fly a2 c2 c1 f2 f1)
   deleted: (at a2 c2) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 14 of 26
56. (debark p13 a2 c1)
   deleted: (in p13 a2)
   added: (at p13 c1)
   goals met: 15 of 26
57. (fly a2 c1 c4 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c4) (fuel-level a2 f0)
   goals met: 15 of 26
58. (board p14 a2 c4)
   deleted: (at p14 c4)
   added: (in p14 a2)
   goals met: 15 of 26
59. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 15 of 26
60. (fly a2 c4 c1 f2 f1)
   deleted: (at a2 c4) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 15 of 26
61. (debark p14 a2 c1)
   deleted: (in p14 a2)
   added: (at p14 c1)
   goals met: 16 of 26
62. (fly a2 c1 c4 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c4) (fuel-level a2 f0)
   goals met: 16 of 26
63. (board p15 a2 c4)
   deleted: (at p15 c4)
   added: (in p15 a2)
   goals met: 16 of 26
64. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 16 of 26
65. (fly a2 c4 c3 f2 f1)
   deleted: (at a2 c4) (fuel-level a2 f2)
   added: (at a2 c3) (fuel-level a2 f1)
   goals met: 16 of 26
66. (debark p15 a2 c3)
   deleted: (in p15 a2)
   added: (at p15 c3)
   goals met: 17 of 26
67. (board p17 a1 c5)
   deleted: (at p17 c5)
   added: (in p17 a1)
   goals met: 17 of 26
68. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 17 of 26
69. (fly a1 c5 c1 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 17 of 26
70. (debark p17 a1 c1)
   deleted: (in p17 a1)
   added: (at p17 c1)
   goals met: 18 of 26
71. (fly a1 c1 c5 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 18 of 26
72. (board p18 a1 c5)
   deleted: (at p18 c5)
   added: (in p18 a1)
   goals met: 18 of 26
73. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 18 of 26
74. (fly a1 c5 c3 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 18 of 26
75. (debark p18 a1 c3)
   deleted: (in p18 a1)
   added: (at p18 c3)
   goals met: 19 of 26
76. (fly a1 c3 c4 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 19 of 26
77. (board p19 a1 c4)
   deleted: (at p19 c4)
   added: (in p19 a1)
   goals met: 19 of 26
78. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 19 of 26
79. (fly a1 c4 c2 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 20 of 26
80. (debark p19 a1 c2)
   deleted: (in p19 a1)
   added: (at p19 c2)
   goals met: 21 of 26
81. (fly a1 c2 c4 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 20 of 26
82. (board p21 a1 c4)
   deleted: (at p21 c4)
   added: (in p21 a1)
   goals met: 20 of 26
83. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 20 of 26
84. (fly a1 c4 c5 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 20 of 26
85. (debark p21 a1 c5)
   deleted: (in p21 a1)
   added: (at p21 c5)
   goals met: 21 of 26
86. (fly a1 c5 c1 f1 f0)
   deleted: (at a1 c5) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 21 of 26
87. (board p22 a1 c1)
   deleted: (at p22 c1)
   added: (in p22 a1)
   goals met: 21 of 26
88. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 21 of 26
89. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 22 of 26
90. (debark p22 a1 c2)
   deleted: (in p22 a1)
   added: (at p22 c2)
   goals met: 23 of 26
91. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 22 of 26
92. (board p23 a1 c1)
   deleted: (at p23 c1)
   added: (in p23 a1)
   goals met: 22 of 26
93. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 22 of 26
94. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 23 of 26
95. (debark p23 a1 c2)
   deleted: (in p23 a1)
   added: (at p23 c2)
   goals met: 24 of 26
96. (fly a1 c2 c5 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 23 of 26
97. (board p24 a1 c5)
   deleted: (at p24 c5)
   added: (in p24 a1)
   goals met: 23 of 26
98. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 23 of 26
99. (fly a1 c5 c2 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 24 of 26
100. (debark p24 a1 c2)
   deleted: (in p24 a1)
   added: (at p24 c2)
   goals met: 25 of 26
101. (fly a2 c3 c5 f1 f0)
   deleted: (at a2 c3) (fuel-level a2 f1)
   added: (at a2 c5) (fuel-level a2 f0)
   goals met: 26 of 26
